const evaluationCriteria = [
  // 🔹 ПІДГОТОВКА
  {
    id: "prep_1",
    group: "Підготовка",
    title: "РМ володіє інформацією про рівень навичок МП",
    description: "Інформація актуальна та підтверджується під час візиту",
    levels: {
      "1": "Не володіє інформацією або вона застаріла та не відповідає дійсності.",
      "2": "Володіє актуальною інформацією по більшості етапів візиту.",
      "3": "Володіє актуальною інформацією по всіх етапах на підставі ІПР та виконання ДЗ."
    }
  },
  {
    id: "prep_2",
    group: "Підготовка",
    title: "РМ володіє інформацією про рівень мотивації МП",
    description: "Визначення мотиваційних напрямків",
    levels: {
      "1": "	Не володіє інформацією або вірно визначено лише 1 напрямок мотивації.",
      "2": "Вірно визначено 2 напрямки мотивації.",
      "3": "Вірно визначено всі 3 напрямки мотивації на підставі ПВ та завдань."
    }
  },
  {
    id: "prep_3",
    group: "Підготовка",
    title: "Підтримка розвитку навичок між візитами",
    description: "Контроль та зворотній зв’язок між ПВ",
    levels: {
      "1": "Не підтримує розвиток навичок або здійснює контроль лише безпосередньо на ПВ.",
      "2": "Контролює розвиток навичок та надає зворотний зв'язок між ПВ.",
      "3": "ЗСистемно контролює розвиток, надає ЗЗ між ПВ + додаткові точки контролю."
    }
  },
  {
    id: "prep_4",
    group: "Підготовка",
    title: "РМ ставить мету на ПВ",
    description: "Постановка цілей по SMART",
    levels: {
      "1": "Не ставить мету або випадають елементи SMART (мета лише по одному з напрямків).",
      "2": "Ставить мету по SMART, але випадає один із напрямків (навички, процеси або бізнес).",
      "3": "Ставить комплексну мету по SMART по всіх 3 напрямках (навички, процеси, бізнес)."
    }
  },

  // 🔹 ПОБУДОВА ВІДНОСИН
  {
    id: "trust_1",
    group: "Встановлення довірливих відносин",
    title: "Побудова довірливих відносин РМ–МП",
    description: "Емоційна атмосфера і контакт",
    levels: {
      "1": "Довірчі відносини не встановлені: МП напружений, постійно сперечається.",
      "2": "Напругу знято, встановлено конструктивний діалог з зоровим контактом.",
      "3": "Конструктивний діалог, МП говорить більше за РМ, зацікавлений у відпрацюванні, ефективний брейнштормінг."
    }
  },
  {
    id: "trust_2",
    group: "Встановлення довірливих відносин",
    title: "Декларація мети ПВ",
    description: "Мета ПВ проговорена і підтримана",
    levels: {
      "1": "Мета не задекларована або викликає негативну реакцію.",
      "2": "Мета задекларована, але не викликає високого інтересу МП.",
      "3": "Мета задекларована, МП щиро зацікавлений та активно ділиться досвідом."
    }
  },

  // 🔹 ПІДГОТОВКА ДО ВІЗИТУ
  {
    id: "prepvisit_1",
    group: "Підготовка до візиту",
    title: "Обговорення інформації про територію",
    description: "Глибина аналізу території",
    levels: {
      "1": "Інформація про територію не обговорюється або її недостатньо для оцінки.",
      "2": "Обговорюють територію, інформації достатньо для оцінки, РМ володіє ситуацією.",
      "3": "Обговорюють територію та планують її розвиток, інформації достатньо, РМ повністю володіє ситуацією."
    }
  },
  {
    id: "prepvisit_2",
    group: "Підготовка до візиту",
    title: "Обговорення планів розвитку бізнесу",
    description: "Рівень деталізації планів",
    levels: {
      "1": "Не обговорюють або обговорюють лише у загальному розумінні.",
      "2": "Обговорюють плани розвитку та ставлять конкретні цілі по SMART.",
      "3": "Повний SMART + розподіл ресурсів + розстановка точок контролю по кожному завданню."
    }
  },
  {
    id: "prepvisit_3",
    group: "Підготовка до візиту",
    title: "Вияснення історії роботи з партнером",
    description: "Наявність деталізації",
    levels: {
      "1": "НІнформація про партнера не обговорюється або обговорюється менш ніж у половині візитів.",
      "2": "Обговорюють інформацію про партнера (ПІБ, категорія, домовленості, конкуренти) більше ніж у 50% візитів.",
      "3": "Обговорюють вичерпну інформацію про партнера по кожному з візитів."
    }
  },
  {
    id: "prepvisit_4",
    group: "Підготовка до візиту",
    title: "Обговорення правил поведінки",
    description: "Чіткість домовленостей",
    levels: {
      "1": "Правила не обговорюються або обговорюються лише для однієї зі сторін.",
      "2": "РМ Обговорює правила поведінки для себе та МП, але пропускає деякі етапи.",
      "3": "РМ Обговорює правила поведінки для РМ та МП у повному обсязі."
    }
  },
   {
    id: "prepvisit_5",
    group: "Підготовка до візиту",
    title: "Пропрацювання мети на візит до партнера",
    description: "Свобода відповіді для МП",
    levels: {
      "1": "Не опрацьовує мету або робить це лише по частині оціночних візитів.",
      "2": "Опрацьовує мету на оціночній сесії та частково при відпрацюванні (використовує уточнюючі питання).",
      "3": "Системно опрацьовує мету на оціночній сесії та при відпрацюванні через відкриті запитання."
    }
  },
   {
    id: "prepvisit_6",
    group: "Підготовка до візиту",
    title: "Обговорення плану візиту до партнера",
    description: "Якість збору інформмації",
    levels: {
      "1": "Не обговорює план візиту або робить це лише по частині оціночних зустрічей.",
      "2": "Обговорює план на оціночній сесії та частково при відпрацюванні навичок.",
      "3": "Системно обговорює план на оціночній сесії та при відпрацюванні через відкриті запитання.."
    }
  },
  // 🔹 ОЦІНКА ВІЗИТУ
  {
    id: "visit_1",
    group: "Оцінка візиту",
    title: "Поведінка менеджера під час візиту",
    description: "Ступінь втручання РМ в бесіду МП з партнером",
    levels: {
      "1": "РМ проводить візит замість МП або часто втручається, перебираючи увагу на себе.",
      "2": "РМ зрідка втручається, але швидко передає слово МП.",
      "3": "РМ не втручається у візит (виняток — дезінформація про продукт/компанію)."
    }
  },
  {
    id: "visit_2",
    group: "Оцінка візиту",
    title: "Пропрацювання досягнення мети візиту",
    description: "Оцінка фактичного досягнення цілей",
    levels: {
      "1": "Не опрацьовує досягнення мети або не порівнює її з початково поставленою.",
      "2": "Опрацьовує досягнення мети на оціночній сесії та частково при відпрацюванні, порівнюючи з метою.",
      "3": "Системно опрацьовує досягнення мети по всіх візитах, порівнюючи з мету по SMART."
    }
  },
   {
    id: "visit_3",
    group: "Оцінка візиту",
    title: "Дотримання структури та критеріїв",
    description: "Оцінка за хронологією і фактами",
    levels: {
      "1": "Не дотримується хронології та критеріїв оцінки (або менше ніж у 50% візитів).",
      "2": "Дотримується хронології та використовує критерії оцінки у 50–75% візитів.",
      "3": "Повністю дотримується хронології та оцінює за критеріями по всіх оціночних візитах (100%)."
    }
  },
   {
    id: "visit_4",
    group: "Оцінка візиту",
    title: "Принцип діагностики (без коригування під час оцінки)",
    description: "Не займається корекцією під час оцінки",
    levels: {
      "1": "Коригує поведінку МП або дає оціночні судження по ходу аналізу.",
      "2": "Дає зворотний зв'язок до завершення оцінки або частково використовує оціночні судження.",
      "3": "Не коригує поведінку МП під час оцінки, дотримується чистої діагностики."
    }
  },

  // 🔹 КОРЕКЦІЯ ПОВЕДІНКИ
  {
    id: "correction_1",
    group: "Корекція поведінки",
    title: "Обирання навику для розвитку",
    description: "Пріоритетність та узгодження навику",
    levels: {
      "1": "Навичка не обрана або обрана з порушенням пріоритету (і не відмічена в ІПР).",
      "2": "Навичка обрана згідно з пріоритетом на підставі оціночних ПВ та відмічена в ІПР.",
      "3": "Навичка обрана за пріоритетом на підставі ПВ, аналізу ДЗ та відмічена в ІПР."
    }
  },
  {
    id: "correction_2",
    group: "Корекція поведінки",
    title: "Вибір техніки розвитку навички МП",
    description: "Адаптація техніки до рівня МП",
    levels: {
      "1": "Техніка не обрана/не застосована або не відповідає компетенціям (проведена з грубими помилками).",
      "2": "Техніка відповідає компетенціям, проведена з невеликими помилками",
      "3": "Техніка повністю відповідає мотивації та компетенціям"
    }
  },
  {
    id: "correction_3",
    group: "Корекція поведінки",
    title: "Впровадження техніки розвитку МП",
    description: "Реалізація техніки та зміна поведінки",
    levels: {
      "1": "Техніка не застосована або проведена з грубими помилками.",
      "2": "Техніка проведена з невеликими помилками; зміна поведінки вимагала додаткових зусиль.",
      "3": "Техніка повністю відповідає мотивації та компетенціям, застосована без помилок, зміна поведінки відбулася природно."
    }
  },

  // 🔹 ВІДПРАЦЮВАННЯ НАВИКУ
  {
    id: "practice_1",
    group: "Відпрацювання навику",
    title: "Теоретична підготовка",
    description: "Формування варіантів дій з боку РМ і МП",
    levels: {
      "1": "Не провів теоретичну підготовку або самостійно нав'язав усі варіанти.",
      "2": "Спочатку запропонував свої варіанти, після чого запитав думку МП.",
      "3": "Спочатку ініціював варіанти від МП, додав свої та разом перевірили їх на придатність."
    }
  },
  {
    id: "practice_2",
    group: "Відпрацювання навику",
    title: "Практичне відпрацювання",
    description: "Форма та глибина практики",
    levels: {
      "1": "Практичне відпрацювання відсутнє або проводиться лише в один спосіб (тільки рольові).",
      "2": "Практичне відпрацювання відбувається і в рольових іграх, і на візитах до партнерів.",
      "3": "Відбувається в рольових іграх та на візитах із оперативним внесенням коректив у процесі."
    }
  },

  // 🔹 ПІСЛЯВІЗИТНИЙ АНАЛІЗ
  {
    id: "post_1",
    group: "Післявізитний аналіз",
    title: "Аналіз розвитку навику",
    description: "Глибина розбору після ПВ",
    levels: {
      "1": "Аналіз не проводиться або надається лише у вигляді загального ЗЗ наприкінці дня.",
      "2": "Проводиться по більшості візитів у вигляді короткого зворотного зв'язку.",
      "3": "Проводиться по кожному візиту у вигляді детального розбору та внесення коректив.",
    }
  },
  {
    id: "post_2",
    group: "Післявізитний аналіз",
    title: "Постановка ДЗ по ПВ",
    description: "Формулювання завдань після ПВ",
    levels: {
      "1": "Не надає ДЗ або надає без SMART / лише за одним напрямком.",
      "2": "Надає ДЗ по SMART очно, але без чіткого проговорення пріоритетів між завданнями.",
      "3": "Надає комплексне ДЗ очно по SMART з чітким розставиланням пріоритетів (навички, бізнес, процеси)."
    }
  },
  {
    id: "post_3",
    group: "Післявізитний аналіз",
    title: "Точки контролю виконання ДЗ",
    description: "Контроль за реалізацією завдань",
    levels: {
      "1": "Не встановлює дедлайнів або ставить одну спільну точку контролю на все.",
      "2": "Встановлює окремі точки контролю для кожного з завдань.",
      "3": "Встановлює точки контролю для кожного з завдань та узгоджує їх із МП."
    }
  }
];