const users = {
  "P.yyy@lkj.com": "Оберіть менеджера",
  "P.xxx@lkj.com": "Оберіть співробітника",
  "rm1": "Атаманов Петро Петрович",
  "rm2": "Сотникова Олена Іванівна",
  "rm3": "Ротний Олександр Вікторович",
  "mp11": "Новачков Іван Іванович",
  "mp12": "Козакова Марія Петрівна",
  "mp13": "Солдатенко Андрій Сергійович",
  "mp21": "Бойцов Олексій Вікторович",
  "mp22": "Курінна Анастасія Олександрівна",
  "mp23": "Єсаулов Дмитро Вікторович",
  "mp31": "Прапорщикова Катерина Вікторівна",
  "mp32": "Сержантова Ольга Вікторівна",
  "mp33": "Капітанова Наталія Вікторівна",
  "admin": "Тренер Павло Васильович"
};

const managerToEmployees = {
  'P.yyy@lkj.com' : ['P.xxx@lkj.com'],
  'rm1': ['mp11', 'mp12', 'mp13'],
  'rm2': ['mp21', 'mp22', 'mp23'],
  'rm3': ['mp31', 'mp32', 'mp33'],
  'admin': ['mp11', 'mp12', 'mp13', 'mp21', 'mp22', 'mp23', 'mp31', 'mp32', 'mp33'],
};

const SupervisorToManager = {
  'admin': ['rm1', 'rm2', 'rm3'],
};